is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecm100.h
#define _IFS5_SPI4EIF_POSITION                   0x00000003
#define _IFS5_SPI4EIF_MASK                       0x00000008
#define _IFS5_SPI4EIF_LENGTH                     0x00000001

#define _IFS5_SPI4RXIF_POSITION                  0x00000004
#define _IFS5_SPI4RXIF_MASK                      0x00000010
#define _IFS5_SPI4RXIF_LENGTH                    0x00000001

#define _IFS5_SPI4TXIF_POSITION                  0x00000005
#define _IFS5_SPI4TXIF_MASK                      0x00000020
#define _IFS5_SPI4TXIF_LENGTH                    0x00000001

#define _IFS5_RTCCIF_POSITION                    0x00000006
#define _IFS5_RTCCIF_MASK                        0x00000040
#define _IFS5_RTCCIF_LENGTH                      0x00000001

#define _IFS5_FCEIF_POSITION                     0x00000007
#define _IFS5_FCEIF_MASK                         0x00000080
#define _IFS5_FCEIF_LENGTH                       0x00000001

#define _IFS5_PREIF_POSITION                     0x00000008
#define _IFS5_PREIF_MASK                         0x00000100
#define _IFS5_PREIF_LENGTH                       0x00000001

#define _IFS5_SQI1IF_POSITION                    0x00000009
#define _IFS5_SQI1IF_MASK                        0x00000200
#define _IFS5_SQI1IF_LENGTH                      0x00000001

#define _IFS5_U4EIF_POSITION                     0x0000000A
#define _IFS5_U4EIF_MASK                         0x00000400
#define _IFS5_U4EIF_LENGTH                       0x00000001

#define _IFS5_U4RXIF_POSITION                    0x0000000B
#define _IFS5_U4RXIF_MASK                        0x00000800
#define _IFS5_U4RXIF_LENGTH                      0x00000001

#define _IFS5_U4TXIF_POSITION                    0x0000000C
#define _IFS5_U4TXIF_MASK                        0x00001000
#define _IFS5_U4TXIF_LENGTH                      0x00000001

#define _IFS5_I2C4BIF_POSITION                   0x0000000D
#define _IFS5_I2C4BIF_MASK                       0x00002000
#define _IFS5_I2C4BIF_LENGTH                     0x00000001

#define _IFS5_I2C4SIF_POSITION                   0x0000000E
#define _IFS5_I2C4SIF_MASK                       0x00004000
#define _IFS5_I2C4SIF_LENGTH                     0x00000001

#define _IFS5_I2C4MIF_POSITION                   0x0000000F
#define _IFS5_I2C4MIF_MASK                       0x00008000
#define _IFS5_I2C4MIF_LENGTH                     0x00000001

#define _IFS5_SPI5EIF_POSITION                   0x00000010
#define _IFS5_SPI5EIF_MASK                       0x00010000
#define _IFS5_SPI5EIF_LENGTH                     0x00000001

#define _IFS5_SPI5RXIF_POSITION                  0x00000011
#define _IFS5_SPI5RXIF_MASK                      0x00020000
#define _IFS5_SPI5RXIF_LENGTH                    0x00000001

#define _IFS5_SPI5TXIF_POSITION                  0x00000012
#define _IFS5_SPI5TXIF_MASK                      0x00040000
#define _IFS5_SPI5TXIF_LENGTH                    0x00000001

#define _IFS5_U5EIF_POSITION                     0x00000013
#define _IFS5_U5EIF_MASK                         0x00080000
#define _IFS5_U5EIF_LENGTH                       0x00000001

#define _IFS5_U5RXIF_POSITION                    0x00000014
#define _IFS5_U5RXIF_MASK                        0x00100000
#define _IFS5_U5RXIF_LENGTH                      0x00000001

#define _IFS5_U5TXIF_POSITION                    0x00000015
#define _IFS5_U5TXIF_MASK                        0x00200000
#define _IFS5_U5TXIF_LENGTH                      0x00000001

#define _IFS5_I2C5BIF_POSITION                   0x00000016
#define _IFS5_I2C5BIF_MASK                       0x00400000
#define _IFS5_I2C5BIF_LENGTH                     0x00000001

#define _IFS5_I2C5SIF_POSITION                   0x00000017
#define _IFS5_I2C5SIF_MASK                       0x00800000
#define _IFS5_I2C5SIF_LENGTH                     0x00000001

#define _IFS5_I2C5MIF_POSITION                   0x00000018
#define _IFS5_I2C5MIF_MASK                       0x01000000
#define _IFS5_I2C5MIF_LENGTH                     0x00000001

#define _IFS5_SPI6IF_POSITION                    0x00000019
#define _IFS5_SPI6IF_MASK                        0x02000000
#define _IFS5_SPI6IF_LENGTH                      0x00000001

#define _IFS5_SPI6RXIF_POSITION                  0x0000001A
#define _IFS5_SPI6RXIF_MASK                      0x04000000
#define _IFS5_SPI6RXIF_LENGTH                    0x00000001

#define _IFS5_SPI6TX_POSITION                    0x0000001B
#define _IFS5_SPI6TX_MASK                        0x08000000
#define _IFS5_SPI6TX_LENGTH                      0x00000001

#define _IFS5_U6EIF_POSITION                     0x0000001C
#define _IFS5_U6EIF_MASK                         0x10000000
#define _IFS5_U6EIF_LENGTH                       0x00000001

#define _IFS5_U6RXIF_POSITION                    0x0000001D
#define _IFS5_U6RXIF_MASK                        0x20000000
#define _IFS5_U6RXIF_LENGTH                      0x00000001

#define _IFS5_U6TXIF_POSITION                    0x0000001E
#define _IFS5_U6TXIF_MASK                        0x40000000
#define _IFS5_U6TXIF_LENGTH                      0x00000001

#define _IFS5_w_POSITION                         0x00000000
#define _IFS5_w_MASK                             0xFFFFFFFF
#define _IFS5_w_LENGTH                           0x00000020

#define _IEC0_CTIE_POSITION                      0x00000000
#define _IEC0_CTIE_MASK                          0x00000001
#define _IEC0_CTIE_LENGTH                        0x00000001

#define _IEC0_CS0IE_POSITION                     0x00000001
#define _IEC0_CS0IE_MASK                         0x00000002
#define _IEC0_CS0IE_LENGTH                       0x00000001

#define _IEC0_CS1IE_POSITION                     0x00000002
#define _IEC0_CS1IE_MASK                         0x00000004
#define _IEC0_CS1IE_LENGTH                       0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000003
#define _IEC0_INT0IE_MASK                        0x00000008
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_T1IE_POSITION                      0x00000004
#define _IEC0_T1IE_MASK                          0x00000010
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_IC1EIE_POSITION                    0x00000005
#define _IEC0_IC1EIE_MASK                        0x00000020
#define _IEC0_IC1EIE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000006
#define _IEC0_IC1IE_MASK                         0x00000040
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000007
#define _IEC0_OC1IE_MASK                         0x00000080
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_INT1IE_POSITION                    0x00000008
#define _IEC0_INT1IE_MASK                        0x00000100
#define _IEC0_INT1IE_LENGTH                      0x00000001

#define _IEC0_T2IE_POSITION                      0x00000009
#define _IEC0_T2IE_MASK                          0x00000200
#define _IEC0_T2IE_LENGTH                        0x00000001

#define _IEC0_IC2EIE_POSITION                    0x0000000A
#define _IEC0_IC2EIE_MASK                        0x00000400
#define _IEC0_IC2EIE_LENGTH                      0x00000001

#define _IEC0_IC2IE_POSITION                     0x0000000B
#define _IEC0_IC2IE_MASK                         0x00000800
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x0000000C
#define _IEC0_OC2IE_MASK                         0x00001000
#define _IEC0_OC2IE_LENGTH                       0x00000001

#define _IEC0_INT2IE_POSITION                    0x0000000D
#define _IEC0_INT2IE_MASK                        0x00002000
#define _IEC0_INT2IE_LENGTH                      0x00000001

#define _IEC0_T3IE_POSITION                      0x0000000E
#define _IEC0_T3IE_MASK                          0x00004000
#define _IEC0_T3IE_LENGTH                        0x00000001

#define _IEC0_IC3EIE_POSITION                    0x0000000F
#define _IEC0_IC3EIE_MASK                        0x00008000
#define _IEC0_IC3EIE_LENGTH                      0x00000001

#define _IEC0_IC3IE_POSITION                     0x00000010
#define _IEC0_IC3IE_MASK                         0x00010000
#define _IEC0_IC3IE_LENGTH                       0x00000001

#define _IEC0_OC3IE_POSITION                     0x00000011
#define _IEC0_OC3IE_MASK                         0x00020000
#define _IEC0_OC3IE_LENGTH                       0x00000001

