is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecm100.h
#define _IPC45_w_POSITION                        0x00000000
#define _IPC45_w_MASK                            0xFFFFFFFF
#define _IPC45_w_LENGTH                          0x00000020

#define _IPC46_I2C5MIS_POSITION                  0x00000000
#define _IPC46_I2C5MIS_MASK                      0x00000003
#define _IPC46_I2C5MIS_LENGTH                    0x00000002

#define _IPC46_I2C5MIP_POSITION                  0x00000002
#define _IPC46_I2C5MIP_MASK                      0x0000001C
#define _IPC46_I2C5MIP_LENGTH                    0x00000003

#define _IPC46_SPI6EIS_POSITION                  0x00000008
#define _IPC46_SPI6EIS_MASK                      0x00000300
#define _IPC46_SPI6EIS_LENGTH                    0x00000002

#define _IPC46_SPI6EIP_POSITION                  0x0000000A
#define _IPC46_SPI6EIP_MASK                      0x00001C00
#define _IPC46_SPI6EIP_LENGTH                    0x00000003

#define _IPC46_SPI6RXIS_POSITION                 0x00000010
#define _IPC46_SPI6RXIS_MASK                     0x00030000
#define _IPC46_SPI6RXIS_LENGTH                   0x00000002

#define _IPC46_SPI6RXIP_POSITION                 0x00000012
#define _IPC46_SPI6RXIP_MASK                     0x001C0000
#define _IPC46_SPI6RXIP_LENGTH                   0x00000003

#define _IPC46_SPI6TXIS_POSITION                 0x00000018
#define _IPC46_SPI6TXIS_MASK                     0x03000000
#define _IPC46_SPI6TXIS_LENGTH                   0x00000002

#define _IPC46_SPI6TXIP_POSITION                 0x0000001A
#define _IPC46_SPI6TXIP_MASK                     0x1C000000
#define _IPC46_SPI6TXIP_LENGTH                   0x00000003

#define _IPC46_w_POSITION                        0x00000000
#define _IPC46_w_MASK                            0xFFFFFFFF
#define _IPC46_w_LENGTH                          0x00000020

#define _IPC47_U6EIS_POSITION                    0x00000000
#define _IPC47_U6EIS_MASK                        0x00000003
#define _IPC47_U6EIS_LENGTH                      0x00000002

#define _IPC47_U6EIP_POSITION                    0x00000002
#define _IPC47_U6EIP_MASK                        0x0000001C
#define _IPC47_U6EIP_LENGTH                      0x00000003

#define _IPC47_U6RXIS_POSITION                   0x00000008
#define _IPC47_U6RXIS_MASK                       0x00000300
#define _IPC47_U6RXIS_LENGTH                     0x00000002

#define _IPC47_U6RXIP_POSITION                   0x0000000A
#define _IPC47_U6RXIP_MASK                       0x00001C00
#define _IPC47_U6RXIP_LENGTH                     0x00000003

#define _IPC47_U6TXIS_POSITION                   0x00000010
#define _IPC47_U6TXIS_MASK                       0x00030000
#define _IPC47_U6TXIS_LENGTH                     0x00000002

#define _IPC47_U6TXIP_POSITION                   0x00000012
#define _IPC47_U6TXIP_MASK                       0x001C0000
#define _IPC47_U6TXIP_LENGTH                     0x00000003

#define _IPC47_w_POSITION                        0x00000000
#define _IPC47_w_MASK                            0xFFFFFFFF
#define _IPC47_w_LENGTH                          0x00000020

#define _OFF000_VOFF_POSITION                    0x00000001
#define _OFF000_VOFF_MASK                        0x0003FFFE
#define _OFF000_VOFF_LENGTH                      0x00000011

#define _OFF001_VOFF_POSITION                    0x00000001
#define _OFF001_VOFF_MASK                        0x0003FFFE
#define _OFF001_VOFF_LENGTH                      0x00000011

#define _OFF002_VOFF_POSITION                    0x00000001
#define _OFF002_VOFF_MASK                        0x0003FFFE
#define _OFF002_VOFF_LENGTH                      0x00000011

#define _OFF003_VOFF_POSITION                    0x00000001
#define _OFF003_VOFF_MASK                        0x0003FFFE
#define _OFF003_VOFF_LENGTH                      0x00000011

#define _OFF004_VOFF_POSITION                    0x00000001
#define _OFF004_VOFF_MASK                        0x0003FFFE
#define _OFF004_VOFF_LENGTH                      0x00000011

#define _OFF005_VOFF_POSITION                    0x00000001
#define _OFF005_VOFF_MASK                        0x0003FFFE
#define _OFF005_VOFF_LENGTH                      0x00000011

#define _OFF006_VOFF_POSITION                    0x00000001
#define _OFF006_VOFF_MASK                        0x0003FFFE
#define _OFF006_VOFF_LENGTH                      0x00000011

#define _OFF007_VOFF_POSITION                    0x00000001
#define _OFF007_VOFF_MASK                        0x0003FFFE
#define _OFF007_VOFF_LENGTH                      0x00000011

#define _OFF008_VOFF_POSITION                    0x00000001
#define _OFF008_VOFF_MASK                        0x0003FFFE
#define _OFF008_VOFF_LENGTH                      0x00000011

#define _OFF009_VOFF_POSITION                    0x00000001
#define _OFF009_VOFF_MASK                        0x0003FFFE
#define _OFF009_VOFF_LENGTH                      0x00000011

#define _OFF010_VOFF_POSITION                    0x00000001
#define _OFF010_VOFF_MASK                        0x0003FFFE
#define _OFF010_VOFF_LENGTH                      0x00000011

#define _OFF011_VOFF_POSITION                    0x00000001
#define _OFF011_VOFF_MASK                        0x0003FFFE
#define _OFF011_VOFF_LENGTH                      0x00000011

#define _OFF012_VOFF_POSITION                    0x00000001
#define _OFF012_VOFF_MASK                        0x0003FFFE
#define _OFF012_VOFF_LENGTH                      0x00000011

#define _OFF013_VOFF_POSITION                    0x00000001
#define _OFF013_VOFF_MASK                        0x0003FFFE
#define _OFF013_VOFF_LENGTH                      0x00000011

#define _OFF014_VOFF_POSITION                    0x00000001
#define _OFF014_VOFF_MASK                        0x0003FFFE
#define _OFF014_VOFF_LENGTH                      0x00000011

#define _OFF015_VOFF_POSITION                    0x00000001
#define _OFF015_VOFF_MASK                        0x0003FFFE
#define _OFF015_VOFF_LENGTH                      0x00000011

#define _OFF016_VOFF_POSITION                    0x00000001
#define _OFF016_VOFF_MASK                        0x0003FFFE
#define _OFF016_VOFF_LENGTH                      0x00000011

#define _OFF017_VOFF_POSITION                    0x00000001
#define _OFF017_VOFF_MASK                        0x0003FFFE
#define _OFF017_VOFF_LENGTH                      0x00000011

#define _OFF018_VOFF_POSITION                    0x00000001
#define _OFF018_VOFF_MASK                        0x0003FFFE
#define _OFF018_VOFF_LENGTH                      0x00000011

#define _OFF019_VOFF_POSITION                    0x00000001
#define _OFF019_VOFF_MASK                        0x0003FFFE
#define _OFF019_VOFF_LENGTH                      0x00000011

#define _OFF020_VOFF_POSITION                    0x00000001
#define _OFF020_VOFF_MASK                        0x0003FFFE
#define _OFF020_VOFF_LENGTH                      0x00000011

#define _OFF021_VOFF_POSITION                    0x00000001
#define _OFF021_VOFF_MASK                        0x0003FFFE
#define _OFF021_VOFF_LENGTH                      0x00000011

