is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecm100.h
#define _USBCSR1_EP6RXIF_POSITION                0x00000006
#define _USBCSR1_EP6RXIF_MASK                    0x00000040
#define _USBCSR1_EP6RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP7RXIF_POSITION                0x00000007
#define _USBCSR1_EP7RXIF_MASK                    0x00000080
#define _USBCSR1_EP7RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP0IE_POSITION                  0x00000010
#define _USBCSR1_EP0IE_MASK                      0x00010000
#define _USBCSR1_EP0IE_LENGTH                    0x00000001

#define _USBCSR1_EP1TXIE_POSITION                0x00000011
#define _USBCSR1_EP1TXIE_MASK                    0x00020000
#define _USBCSR1_EP1TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP2TXIE_POSITION                0x00000012
#define _USBCSR1_EP2TXIE_MASK                    0x00040000
#define _USBCSR1_EP2TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP3TXIE_POSITION                0x00000013
#define _USBCSR1_EP3TXIE_MASK                    0x00080000
#define _USBCSR1_EP3TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP4TXIE_POSITION                0x00000014
#define _USBCSR1_EP4TXIE_MASK                    0x00100000
#define _USBCSR1_EP4TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP5TXIE_POSITION                0x00000015
#define _USBCSR1_EP5TXIE_MASK                    0x00200000
#define _USBCSR1_EP5TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP6TXIE_POSITION                0x00000016
#define _USBCSR1_EP6TXIE_MASK                    0x00400000
#define _USBCSR1_EP6TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP7TXIE_POSITION                0x00000017
#define _USBCSR1_EP7TXIE_MASK                    0x00800000
#define _USBCSR1_EP7TXIE_LENGTH                  0x00000001

#define _USBCSR2_EP1RXIE_POSITION                0x00000001
#define _USBCSR2_EP1RXIE_MASK                    0x00000002
#define _USBCSR2_EP1RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP2RXIE_POSITION                0x00000002
#define _USBCSR2_EP2RXIE_MASK                    0x00000004
#define _USBCSR2_EP2RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP3RXIE_POSITION                0x00000003
#define _USBCSR2_EP3RXIE_MASK                    0x00000008
#define _USBCSR2_EP3RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP4RXIE_POSITION                0x00000004
#define _USBCSR2_EP4RXIE_MASK                    0x00000010
#define _USBCSR2_EP4RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP5RXIE_POSITION                0x00000005
#define _USBCSR2_EP5RXIE_MASK                    0x00000020
#define _USBCSR2_EP5RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP6RXIE_POSITION                0x00000006
#define _USBCSR2_EP6RXIE_MASK                    0x00000040
#define _USBCSR2_EP6RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP7RXIE_POSITION                0x00000007
#define _USBCSR2_EP7RXIE_MASK                    0x00000080
#define _USBCSR2_EP7RXIE_LENGTH                  0x00000001

#define _USBCSR2_SUSPIF_POSITION                 0x00000010
#define _USBCSR2_SUSPIF_MASK                     0x00010000
#define _USBCSR2_SUSPIF_LENGTH                   0x00000001

#define _USBCSR2_RESUMEIF_POSITION               0x00000011
#define _USBCSR2_RESUMEIF_MASK                   0x00020000
#define _USBCSR2_RESUMEIF_LENGTH                 0x00000001

#define _USBCSR2_RESETIF_POSITION                0x00000012
#define _USBCSR2_RESETIF_MASK                    0x00040000
#define _USBCSR2_RESETIF_LENGTH                  0x00000001

#define _USBCSR2_SOFIF_POSITION                  0x00000013
#define _USBCSR2_SOFIF_MASK                      0x00080000
#define _USBCSR2_SOFIF_LENGTH                    0x00000001

#define _USBCSR2_CONNIF_POSITION                 0x00000014
#define _USBCSR2_CONNIF_MASK                     0x00100000
#define _USBCSR2_CONNIF_LENGTH                   0x00000001

#define _USBCSR2_DISCONIF_POSITION               0x00000015
#define _USBCSR2_DISCONIF_MASK                   0x00200000
#define _USBCSR2_DISCONIF_LENGTH                 0x00000001

#define _USBCSR2_SESSRQIF_POSITION               0x00000016
#define _USBCSR2_SESSRQIF_MASK                   0x00400000
#define _USBCSR2_SESSRQIF_LENGTH                 0x00000001

#define _USBCSR2_VBUSERRIF_POSITION              0x00000017
#define _USBCSR2_VBUSERRIF_MASK                  0x00800000
#define _USBCSR2_VBUSERRIF_LENGTH                0x00000001

#define _USBCSR2_SUSPIE_POSITION                 0x00000018
#define _USBCSR2_SUSPIE_MASK                     0x01000000
#define _USBCSR2_SUSPIE_LENGTH                   0x00000001

#define _USBCSR2_RESUMEIE_POSITION               0x00000019
#define _USBCSR2_RESUMEIE_MASK                   0x02000000
#define _USBCSR2_RESUMEIE_LENGTH                 0x00000001

#define _USBCSR2_RESETIE_POSITION                0x0000001A
#define _USBCSR2_RESETIE_MASK                    0x04000000
#define _USBCSR2_RESETIE_LENGTH                  0x00000001

#define _USBCSR2_SOFIE_POSITION                  0x0000001B
#define _USBCSR2_SOFIE_MASK                      0x08000000
#define _USBCSR2_SOFIE_LENGTH                    0x00000001

#define _USBCSR2_CONNIE_POSITION                 0x0000001C
#define _USBCSR2_CONNIE_MASK                     0x10000000
#define _USBCSR2_CONNIE_LENGTH                   0x00000001

#define _USBCSR2_DISCONIE_POSITION               0x0000001D
#define _USBCSR2_DISCONIE_MASK                   0x20000000
#define _USBCSR2_DISCONIE_LENGTH                 0x00000001

#define _USBCSR2_SESSRQIE_POSITION               0x0000001E
#define _USBCSR2_SESSRQIE_MASK                   0x40000000
#define _USBCSR2_SESSRQIE_LENGTH                 0x00000001

#define _USBCSR2_VBUSERRIE_POSITION              0x0000001F
#define _USBCSR2_VBUSERRIE_MASK                  0x80000000
#define _USBCSR2_VBUSERRIE_LENGTH                0x00000001

#define _USBCSR3_RFRMNUM_POSITION                0x00000000
#define _USBCSR3_RFRMNUM_MASK                    0x000007FF
#define _USBCSR3_RFRMNUM_LENGTH                  0x0000000B

#define _USBCSR3_ENDPOINT_POSITION               0x00000010
#define _USBCSR3_ENDPOINT_MASK                   0x000F0000
#define _USBCSR3_ENDPOINT_LENGTH                 0x00000004

